Tekla.Structures.Model.ModelObjectEnumerator
The ModelObjectEnumerator class provides the means to iterate through model object instances in the
current model.
A model object enumerator can be used in a foreach loop:
using Tekla.Structures.Model;
public class Example
{
public void Example1()
{
Model Model = new Model();
ModelObjectEnumerator Objects = Model.GetModelObjectSelector().GetAllObjectsWithType(ModelObject.ModelObjectEnum.BEAM);
foreach (Beam obj in Objects)
{
if(obj != null)
{
Solid Solid = obj.GetSolid();
}
}
}
}
Another way is to browse items "manually":
using Tekla.Structures.Model;
public class Example
{
public void Example1()
{
Model Model = new Model();
ModelObjectEnumerator Enum = Model.GetModelObjectSelector().GetAllObjects();
while(Enum.MoveNext())
{
Beam B = Enum.Current as Beam;
if(B != null)
{
Solid Solid = B.GetSolid();
}
}
}
}
A model object enumerator with AutoFetch set to true in a foreach loop:
using Tekla.Structures.Model;
public class Example
{
public void Example1()
{
Model Model = new Model();
ModelObjectEnumerator.AutoFetch = true;
ModelObjectEnumerator Objects = Model.GetModelObjectSelector().GetAllObjectsWithType(ModelObject.ModelObjectEnum.BEAM);
foreach (Beam obj in Objects)
{
if(obj != null)
{
Solid Solid = obj.GetSolid();
}
}
}
}

Tekla.Structures.Model.ModelObjectEnumerator.SelectInstances
Indicates that the instance Select() is called when the 'Current' item is asked from the enumerator.
The user can set this to 'false' if no members are ever asked from the instance. This is the case
when, for example, asking only a report property from the identifier. Warning: normally the user should not
change this value.

Tekla.Structures.Model.ModelObjectEnumerator.AutoFetch
Indicates that the objects are fetched from the model when the enumerator is created.
Object information is therefore not anymore fetched when 'Current' item is asked from the enumerator.
Warning: changing of TransformationPlane after creation of enumerator or during the enumeration
requires a separate selection of object for refreshing the values.
Property value is used for all enumerators in application

Tekla.Structures.Model.ModelObjectEnumerator.Current
The current model object instance active in the enumerator.
The value is null if there are no more objects left.

Tekla.Structures.Model.ModelObjectEnumerator.System#Collections#IEnumerator#Current
The implementation for the Current property required by the IEnumerator. The returned object
is always of the type ModelObject.

Tekla.Structures.Model.ModelObjectEnumerator.#ctor
Default constructor.

Tekla.Structures.Model.ModelObjectEnumerator.#ctor(Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorTypeEnum,Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorSubTypeEnum,Tekla.Structures.Model.ModelObject)
Instantiates a new enumerator of given type.
type: Type of enumerator
subType: Subtype of enumerator
Object: Additional ModelObject instance needed to create the enumerator

Tekla.Structures.Model.ModelObjectEnumerator.#ctor(Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorTypeEnum,Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorSubTypeEnum,System.String,Tekla.Structures.Model.ModelObject)
Instantiates a new enumerator of given type.
type: Type of enumerator.
subType: Subtype of enumerator.
parameter: Additional information.
Object: Additional ModelObject instance needed to create the enumerator

Tekla.Structures.Model.ModelObjectEnumerator.#ctor(Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorTypeEnum,System.String,System.String)
Initializes a new instance of the Tekla.Structures.Model.ModelObjectEnumerator class.
type: The type.
filterName: Name of the filter.
modificationStamp: The modification stamp.
Throws System.ArgumentException: Enumerator type must be MODIFIED_OBJECTS_BY_FILTER_NAME

Tekla.Structures.Model.ModelObjectEnumerator.#ctor(Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorTypeEnum)
Instantiates a new enumerator of given type.
type: Type of the enumerator

Tekla.Structures.Model.ModelObjectEnumerator.#ctor(Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorTypeEnum,Tekla.Structures.Model.ModelObject.ModelObjectEnum)
Instantiates a new enumerator of given object type.
type:
objectType:

Tekla.Structures.Model.ModelObjectEnumerator.#ctor(Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorTypeEnum,System.Type[])
Instantiates a new enumerator of given object type.
type:
typeFilter:

Tekla.Structures.Model.ModelObjectEnumerator.#ctor(Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorTypeEnum,Tekla.Structures.Model.ModelObject.ModelObjectEnum,System.String)
Select by type and filter
type: Only EnumeratorTypeEnum.FILTERED_OBJECTS_WITH_TYPE
objectType:
Parameter: Filter name or the modification stamp

Tekla.Structures.Model.ModelObjectEnumerator.#ctor(Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorTypeEnum,System.Collections.Generic.IEnumerable{Tekla.Structures.Model.ModelObject.ModelObjectEnum},System.String)
Select by modification stamp with type filtering
type: Type of modification to search of object to select
objectTypes: The object types.
Parameter: The parameter.
Throws System.ArgumentException: Invalid argument type

Tekla.Structures.Model.ModelObjectEnumerator.#ctor(Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorTypeEnum,System.Collections.Generic.IEnumerable{Tekla.Structures.Model.ModelObject.ModelObjectEnum},System.String,System.Nullable{System.Boolean},System.Boolean)
Select by modification stamp with type filtering
type: Type of modification to search of object to select
objectTypes: The object types.
Parameter: The parameter.
selectInstancesDefault: Default value for the SelectInstance - property or null
returnAlsoIfObjectIsCreatedAndDeletedAfterEvent: if set to true return object as deleted also if object is created and deleted after event.
Throws System.ArgumentException: Invalid argument type

Tekla.Structures.Model.ModelObjectEnumerator.#ctor(Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorTypeEnum,System.Int32,System.Int32)
Instantiates a new enumerator for modified objects after ModStamp.
type:
modStamp:
saveStamp:

Tekla.Structures.Model.ModelObjectEnumerator.#ctor(Tekla.Structures.Model.ModelObjectEnumerator.EnumeratorTypeEnum,System.Collections.Generic.IEnumerable{Tekla.Structures.Model.ModelObject.ModelObjectEnum},System.Int32,System.Int32)
Instantiates a new enumerator for modified or deleted objects after Stamp.
type: The type.
objectTypes: The object types.
modStamp: The mod stamp.
saveStamp: The save stamp.
Throws System.ArgumentException: Invalid enumerator type

Tekla.Structures.Model.ModelObjectEnumerator.#ctor(System.Collections.ArrayList,System.Collections.ArrayList)
Enumerator with already defined IDs and types.
identifiers: Identifiers to enumerate
types: Types to enumerate

Tekla.Structures.Model.ModelObjectEnumerator.MakeObjectEnumArray(System.Collections.Generic.IEnumerable{Tekla.Structures.Model.ModelObject.ModelObjectEnum})
Creates Array to be placed to Tekla.Structures.ModelInternal.dotEnumerator_t.aObjectTypes.
types: Types to add.
Returns: New allocated array.

Tekla.Structures.Model.ModelObjectEnumerator.GetAllFromDatabase(Tekla.Structures.ModelInternal.dotEnumerator_t)
Gets the objects from DB. Enumerator's rules must
be correctly filled in before calling this method.
enumerator: Enumerator including possible select rules and filters.
Returns:

Tekla.Structures.Model.ModelObjectEnumerator.GetAllFromDB_FAST(Tekla.Structures.ModelInternal.dotEnumerator_t@)
Gets the objects from DB. Enumerator's rules must
be correctly filled in before calling this method.
enumerator: Enumerator including possible select rules and filters.
Returns:

Tekla.Structures.Model.ModelObjectEnumerator.MoveNext
Moves to the next item in the enumerator.
Returns: False on failure.

Tekla.Structures.Model.ModelObjectEnumerator.Reset
Resets the enumerator to the beginning.

Tekla.Structures.Model.ModelObjectEnumerator.GetSize
Returns the total amount of items.
Returns: The total amount of items.

Tekla.Structures.Model.ModelObjectEnumerator.GetEnumerator
Gets the enumerator.
Returns: The enumerator.